[
	{
		"Text": "You can download many poses from various mod archives, like The Glamour Dresser and Aether Link, or check out the Directory in our Discord server for pose-related servers!",
		"Url": "https://discord.gg/KvGJCCnG8t"
	},
	{
		"Text": "Tips on the Home Tab will give you tips."
	},
	{
		"Text": "To restore your default appearance, close Anamnesis, then go to another area, ensuring you've forced a loading screen with an area title."
	},
	{
		"Text": "Use [Shift] and [Ctrl] to speed up or slow down the intervals of your rotation/position."
	},
	{
		"Text": "You can change the values of sliders, input boxes, and gizmos with the scroll wheel."
	},
	{
		"Text": "The Anamnesis window can be made transparent in the Settings Panel."
	},
	{
		"Text": "You can change the current theme in the Settings Panel."
	},
	{
		"Text": "Need more actors but have no friends? Use housing NPCs!"
	},
	{
		"Text": "The Wiki has useful guides to help you with using Anamnesis.",
		"Url": "https://github.com/imchillin/Anamnesis/wiki"
	},
	{
		"Text": "Game updates will likely break the tool. Please be patient when this happens, and we will have a fix out ASAP."
	},
	{
		"Text": "You can use housing NPCs, Carbuncles, and other NPCs as detailed in the wiki as extra actors.",
		"Url": "https://github.com/imchillin/Anamnesis/wiki"
	},
	{
		"Text": "You can use poses made for other races, but they may require adjustment."
	},
	{
		"Text": "If hair or ears go funny when loading a pose, turn Physics on, then off again."
	},
	{
		"Text": "Make sure you're running Anamnesis as an Administrator."
	},
	{
		"Text": "You can only pose actors while in GPose."
	},
	{
		"Text": "Anamnesis cannot be used for gameplay advantages. If you find an exploit using Anamnesis, please report it to the developers.",
		"Url": "https://discord.gg/KvGJCCnG8t"
	},
	{
		"Text": "You can set skin, skin glow, lip, eye, and hair colour by RGB using the Extended Appearance function."
	},
	{
		"Text": "You can change the time of day and the weather in the 'World' section."
	},
	{
		"Text": "You can change the window size in the Settings Panel."
	},
	{
		"Text": "When it comes to PCs: Friends, Party Members, FC Members and Alliance Raid Members can be manipulated."
	},
	{
		"Text": "If you ever come across a bug that can be reproduced, please file the issue in our GitHub, ensuring you have provided all the steps on how to reproduce the bug.",
		"Url": "https://github.com/imchillin/Anamnesis/issues"
	},
	{
		"Text": "Going in first-person mode allows you to capture perfect shots where normally the camera would block due to collision!"
	},
	{
		"Text": "When using the Pose tab, if you don't have a bone selected, you can use the Transform function to change your actor's scale and position."
	},
	{
		"Text": "Remember to unfreeze time in the GPose menu before trying to change it via Anamnesis."
	},
	{
		"Text": "Don't be afraid to use real life model references to make your pose look more organic and natural."
	},
	{
		"Text": "You can use Advanced Load to load hands and facial expressions from other poses you've made to save time."
	},
	{
		"Text": "If you feel that a pose you made looks off, try replicating it yourself, in real life. You'll realise quite quickly how something should or should not bend if you try it yourself."
	},
	{
		"Text": "You can scale weapons to 0 while in GPose to make them disappear, in case you forgot to hide them earlier."
	},
	{
		"Text": "Try using the Gizmo while posing!"
	},
	{
		"Text": "The Gizmo updates in real time, and is based on your camera, so you can easily see what axis you're manipulating at a glance."
	},
	{
		"Text": "When using the Gizmo, if you right-click to lock an axis, you can use the scroll wheel to change the value, and use CTRL/SHIFT to change the speed."
	},
	{
		"Text": "The Anamnesis Wiki has a lot of useful information about using Anamnesis!",
		"Url": "https://github.com/imchillin/Anamnesis/wiki"
	},
	{
		"Text": "The XIV Tools Discord's Wiki channel has many useful links and guides to help you use Anamnesis!",
		"Url": "https://discord.gg/KvGJCCnG8t"
	},
	{
		"Text": "Hold shift while Anamnesis is starting to reset your settings."
	},
	{
		"Text": "Do you use Penumbra, Glamourer, or Brio? Anamnesis has interoperability with these tools!"
	},
	{
		"Text": "Anamnesis works well when used in tandem with Ktisis!"
	}
]
